pmo-dataset/graphviz/23.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "scoring request\nreceived_1" -> "request credit score";
  "request credit score" -> "score received?";
  "score received?" -> "report delay" [label="no"];
  "report delay" -> "credit score\nreceived";
  "credit score\nreceived" -> "ExclusiveGateway_1";
  "score received?" -> "ExclusiveGateway_1" [label="yes"];
  "ExclusiveGateway_1" -> "send credit score_1";
  "send credit score_1" -> "scoring request\nhandled_1";
  "scoring request\nreceived_2" -> "compute credit score\n(level 1)";
  "compute credit score\n(level 1)" -> "send result";
  "send result" -> "score available?";
  "score available?" -> "compute credit score\n(level 2)" [label="no"];
  "compute credit score\n(level 2)" -> "send credit score_2";
  "send credit score_2" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "scoring request\nhandled_2";
  "score available?" -> "ExclusiveGateway_2" [label="yes"];
  "Pool_1" -> "scoring request\nreceived_1" [style=dashed, arrowhead=open];
  "report delay" -> "Pool_1" [style=dashed, arrowhead=open];
  "send credit score_1" -> "Pool_1" [style=dashed, arrowhead=open];
  "request credit score" -> "scoring request\nreceived_2" [style=dashed, arrowhead=open];
  "send result" -> "request credit score" [style=dashed, arrowhead=open];
  "send credit score_2" -> "credit score\nreceived" [style=dashed, arrowhead=open];

  subgraph "cluster_Pool_1" {
    label="credit scoring\nfrontend (bank)";
    "Pool_1" [shape=point, style=invis];
  }

  subgraph "cluster_Pool_2" {
    label="credit scoring\n(bank)";
    "request credit score";
    "send credit score_1";
    "report delay";
    "scoring request\nreceived_1";
    "scoring request\nhandled_1";
    "credit score\nreceived";
    "score received?";
    "ExclusiveGateway_1";
  }

  subgraph "cluster_Pool_3" {
    label="scoring service";
    "compute credit score\n(level 1)";
    "send result";
    "compute credit score\n(level 2)";
    "send credit score_2";
    "scoring request\nreceived_2";
    "scoring request\nhandled_2";
    "score available?";
    "ExclusiveGateway_2";
  }

  "send credit score_1" [label="send credit score"];
  "send credit score_2" [label="send credit score"];
  "scoring request\nreceived_1" [label="scoring request\nreceived", shape=circle];
  "scoring request\nhandled_1" [label="scoring request\nhandled", shape=circle, penwidth=4];
  "credit score\nreceived" [shape=doublecircle];
  "scoring request\nreceived_2" [label="scoring request\nreceived", shape=circle];
  "scoring request\nhandled_2" [label="scoring request\nhandled", shape=circle, penwidth=4];
  "score received?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "score available?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
}
